app/controllers/articles_controller.rb

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("updated_at", "title", "body", "author", "created_at") VALUES('2009-08-12 22:34:56', 'vasya''s story', 'hello there my firend', 'vasya', '2009-08-12 22:34:56')

  def update
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)