app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM "comments"

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("updated_at", "body", "article_id", "created_at") VALUES('2009-08-16 21:30:13', 'test', 1, '2009-08-16 21:30:13')